###[DataFrame 연산 - 2]
- 일대일 대응으로 인덱스가 동인한 원소들끼리 연산 수행
- Dataframe과 Dataframe 연산 수행

In [4]:
# [1] 모듈 로딩
import pandas as pd

In [5]:
# [2] 데이터 준비
data={'A':[98,78,100,52],
      'B':[90,20,40,50]}

In [6]:
# [4] Dict 데이터 ==> DataFrame 형태 저장
DF1=pd.DataFrame(data)
DF2=DF1 / 4

In [7]:
#- 연산 수행
# - 산술연산 
DF1 - DF2

      A     B
0  73.5  67.5
1  58.5  15.0
2  75.0  30.0
3  39.0  37.5

In [8]:
# - 비교연산
DF1 != DF2

      A     B
0  True  True
1  True  True
2  True  True
3  True  True

In [9]:
# [5] 연산 수행 => DataFrame과 Series
# - 산술연산
# - 'A' 컬럼만 추출
sr1=DF1.A
sr1.index

RangeIndex(start=0, stop=4, step=1)

In [11]:
DF2.index

RangeIndex(start=0, stop=4, step=1)

In [13]:
DF2 + sr1

    A   B   0   1   2   3
0 NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN

In [18]:
# [방법1] SR==> DF 으로 변환
SRDF=sr1.to_frame()
SRDF
DF1+SRDF

     A   B
0  196 NaN
1  156 NaN
2  200 NaN
3  104 NaN

In [22]:
DF1.columns=[0,1]
DF1.T

    0   1    2   3
0  98  78  100  52
1  90  20   40  50

In [24]:
sr1, sr1+DF1

(0     98
 1     78
 2    100
 3     52
 Name: A, dtype: int64,
      0    1   2   3
 0  196  168 NaN NaN
 1  176   98 NaN NaN
 2  198  118 NaN NaN
 3  150  128 NaN NaN)